Revit 2027 API
InitialIlluminanceIntensity(InitialIlluminanceIntensity) Constructor
 Creates a copy of the given initial illuminance intensity object
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public InitialIlluminanceIntensity(
	InitialIlluminanceIntensity other
)
Public Sub New (
	other As InitialIlluminanceIntensity
)
public:
InitialIlluminanceIntensity(
	InitialIlluminanceIntensity^ other
)
new :
        other : InitialIlluminanceIntensity -> InitialIlluminanceIntensity
Parameters
other InitialIlluminanceIntensity
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
InitialIlluminanceIntensity Class
InitialIlluminanceIntensity Overload
Autodesk.Revit.DB.Lighting Namespace